import UIKit

/*:
# Naming Convention (이름 정의 규칙)
*/
                                                                                            /*
- 식별자의 이름을 정의 할때 따라야 하는 CamelCase라고 불리는 규칙이다 CamelCase에는
 UpperCamelCase, lowerCamelCase 이렇게 총 두가지로 구성된다

 


                                                                                            */
/*:
## 1. UpperCamelCase
*/
                                                                                            /*
- 항상 식별자의 첫번째 문자는 대문자로 표기 해여 하며, 만약 여러단어가 포함되어 있는 경우라면
 각 단어를 구분짓게 해주기 위해서 마찬가지로 대문자로 표기해여한다.

                                                                                
ex)
  UpperCamelCase: 규칙자체의 이름에서 보여지듯이 식별자의 첫단어를 대문자'U'로 지정하였고,
 그 뒤에 Camel, Case 같이 서로 상이한 단어들을 구분짓기 위해서 각단어의 시작을 대문자로 지정하였다.
 나머지 문자는 모두 소문자로 지정해준다.

UpperCamelCase를 따르는 대표적인 예
- 클래스 이름
- 구조체 이름
- 열거향 이름
- 익스텐션 이름
- 프로토콜 이름
                                                                                            */





/*:
## 2. lowerCamelCase
*/
                                                                                            /*
- 항상 식별자의 첫번째 문자는 소문자로 표기해야 하며, 나머지는 UpperCamelCase와 동일하다.


ex)
 lowerCamelCase : 보다시피 식별자의 첫단어를 소문자'l'로 지정하였다. 나머지 규칙은
 UpperCamelCase와 동일하다


 lowerCamelCase를 따르는 대표적인 예
- 변수 이름
- 상수 이름
- 함수 이름
- 속성 이름
- 메소드 이름
- 파라미터 이름

 위의 규칙들을 따르는 가장 큰이유는 코드의 '가독성' 때문이다. 가독성이 좋으면 시각적으로 완성도 있어 보일 뿐
 만 아니라 코드의 실수도 최소화 할 수 있다.
                                                                                        
 
                                                                                            */
